susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H7A2.h
#define DFSDM1_CKIN5_PB7_ PB7,GPIO_AF11
#define DFSDM1_CKIN5_PC10_ PC10,GPIO_AF3
#define DFSDM1_CKIN5_PE13_ PE13,GPIO_AF3
#define _DFSDM1_CKIN5_PB7_ 1
#define _DFSDM1_CKIN5_PC10_ 1
#define _DFSDM1_CKIN5_PE13_ 1

#define DFSDM1_CKIN6_PD0_ PD0,GPIO_AF3
#define DFSDM1_CKIN6_PF14_ PF14,GPIO_AF3
#define _DFSDM1_CKIN6_PD0_ 1
#define _DFSDM1_CKIN6_PF14_ 1

#define DFSDM1_CKIN7_PB11_ PB11,GPIO_AF6
#define DFSDM1_CKIN7_PB8_ PB8,GPIO_AF3
#define _DFSDM1_CKIN7_PB11_ 1
#define _DFSDM1_CKIN7_PB8_ 1

#define DFSDM1_CKOUT_PB0_ PB0,GPIO_AF6
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PC2_C_ PC2_C,GPIO_AF6
#define DFSDM1_CKOUT_PD10_ PD10,GPIO_AF3
#define DFSDM1_CKOUT_PD3_ PD3,GPIO_AF3
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF3
#define _DFSDM1_CKOUT_PB0_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PC2_C_ 1
#define _DFSDM1_CKOUT_PD10_ 1
#define _DFSDM1_CKOUT_PD3_ 1
#define _DFSDM1_CKOUT_PE9_ 1

#define DFSDM1_DATIN0_PC1_ PC1,GPIO_AF3
#define _DFSDM1_DATIN0_PC1_ 1

#define DFSDM1_DATIN1_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PC3_ PC3,GPIO_AF3
#define DFSDM1_DATIN1_PC3_C_ PC3_C,GPIO_AF3
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF4
#define _DFSDM1_DATIN1_PB1_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PC3_ 1
#define _DFSDM1_DATIN1_PC3_C_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PC5_ PC5,GPIO_AF3
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF3
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PC5_ 1
#define _DFSDM1_DATIN2_PE7_ 1

#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF4
#define DFSDM1_DATIN3_PD9_ PD9,GPIO_AF3
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF3
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PD9_ 1
#define _DFSDM1_DATIN3_PE4_ 1

#define DFSDM1_DATIN4_PC0_ PC0,GPIO_AF6
#define DFSDM1_DATIN4_PD7_ PD7,GPIO_AF3
#define DFSDM1_DATIN4_PE10_ PE10,GPIO_AF3
#define _DFSDM1_DATIN4_PC0_ 1
#define _DFSDM1_DATIN4_PD7_ 1
#define _DFSDM1_DATIN4_PE10_ 1

#define DFSDM1_DATIN5_PB6_ PB6,GPIO_AF11
#define DFSDM1_DATIN5_PC11_ PC11,GPIO_AF3
#define DFSDM1_DATIN5_PE12_ PE12,GPIO_AF3
#define _DFSDM1_DATIN5_PB6_ 1
#define _DFSDM1_DATIN5_PC11_ 1
#define _DFSDM1_DATIN5_PE12_ 1

#define DFSDM1_DATIN6_PD1_ PD1,GPIO_AF3
#define DFSDM1_DATIN6_PF13_ PF13,GPIO_AF3
#define _DFSDM1_DATIN6_PD1_ 1
#define _DFSDM1_DATIN6_PF13_ 1

#define DFSDM1_DATIN7_PB10_ PB10,GPIO_AF6
#define DFSDM1_DATIN7_PB9_ PB9,GPIO_AF3
#define _DFSDM1_DATIN7_PB10_ 1
#define _DFSDM1_DATIN7_PB9_ 1

#define DFSDM2_CKIN0_PC10_ PC10,GPIO_AF4
#define _DFSDM2_CKIN0_PC10_ 1

#define DFSDM2_CKIN1_PA2_ PA2,GPIO_AF6
#define DFSDM2_CKIN1_PB13_ PB13,GPIO_AF4
#define _DFSDM2_CKIN1_PA2_ 1
#define _DFSDM2_CKIN1_PB13_ 1

#define DFSDM2_CKOUT_PB0_ PB0,GPIO_AF4
#define DFSDM2_CKOUT_PC12_ PC12,GPIO_AF4
#define DFSDM2_CKOUT_PD10_ PD10,GPIO_AF4
#define _DFSDM2_CKOUT_PB0_ 1
#define _DFSDM2_CKOUT_PC12_ 1
#define _DFSDM2_CKOUT_PD10_ 1

#define DFSDM2_DATIN0_PC11_ PC11,GPIO_AF4
#define _DFSDM2_DATIN0_PC11_ 1

#define DFSDM2_DATIN1_PA7_ PA7,GPIO_AF4
#define DFSDM2_DATIN1_PB12_ PB12,GPIO_AF11
#define _DFSDM2_DATIN1_PA7_ 1
#define _DFSDM2_DATIN1_PB12_ 1

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA0_C_ PA0_C,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13_ PA13,GPIO_AF15
#define EVENTOUT_PA14_ PA14,GPIO_AF15
#define EVENTOUT_PA15_ PA15,GPIO_AF15
#define EVENTOUT_PA1_C_ PA1_C,GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3_ PB3,GPIO_AF15
#define EVENTOUT_PB4_ PB4,GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF15
#define EVENTOUT_PC1_ PC1,GPIO_AF15
#define EVENTOUT_PC10_ PC10,GPIO_AF15
#define EVENTOUT_PC11_ PC11,GPIO_AF15
#define EVENTOUT_PC12_ PC12,GPIO_AF15
#define EVENTOUT_PC13_ PC13,GPIO_AF15
#define EVENTOUT_PC14_ PC14,GPIO_AF15
#define EVENTOUT_PC15_ PC15,GPIO_AF15
#define EVENTOUT_PC2_ PC2,GPIO_AF15
#define EVENTOUT_PC2_C_ PC2_C,GPIO_AF15
#define EVENTOUT_PC3_ PC3,GPIO_AF15
#define EVENTOUT_PC3_C_ PC3_C,GPIO_AF15
#define EVENTOUT_PC4_ PC4,GPIO_AF15
#define EVENTOUT_PC5_ PC5,GPIO_AF15
#define EVENTOUT_PC6_ PC6,GPIO_AF15
#define EVENTOUT_PC7_ PC7,GPIO_AF15
#define EVENTOUT_PC8_ PC8,GPIO_AF15
#define EVENTOUT_PC9_ PC9,GPIO_AF15
#define EVENTOUT_PD0_ PD0,GPIO_AF15
#define EVENTOUT_PD1_ PD1,GPIO_AF15
#define EVENTOUT_PD10_ PD10,GPIO_AF15
#define EVENTOUT_PD11_ PD11,GPIO_AF15
#define EVENTOUT_PD12_ PD12,GPIO_AF15
#define EVENTOUT_PD13_ PD13,GPIO_AF15
#define EVENTOUT_PD14_ PD14,GPIO_AF15
#define EVENTOUT_PD15_ PD15,GPIO_AF15
#define EVENTOUT_PD2_ PD2,GPIO_AF15
#define EVENTOUT_PD3_ PD3,GPIO_AF15
#define EVENTOUT_PD4_ PD4,GPIO_AF15
#define EVENTOUT_PD5_ PD5,GPIO_AF15
#define EVENTOUT_PD6_ PD6,GPIO_AF15
#define EVENTOUT_PD7_ PD7,GPIO_AF15
#define EVENTOUT_PD8_ PD8,GPIO_AF15
#define EVENTOUT_PD9_ PD9,GPIO_AF15
#define EVENTOUT_PE0_ PE0,GPIO_AF15
#define EVENTOUT_PE1_ PE1,GPIO_AF15
#define EVENTOUT_PE10_ PE10,GPIO_AF15
#define EVENTOUT_PE11_ PE11,GPIO_AF15
#define EVENTOUT_PE12_ PE12,GPIO_AF15
#define EVENTOUT_PE13_ PE13,GPIO_AF15
#define EVENTOUT_PE14_ PE14,GPIO_AF15
#define EVENTOUT_PE15_ PE15,GPIO_AF15
#define EVENTOUT_PE2_ PE2,GPIO_AF15
#define EVENTOUT_PE3_ PE3,GPIO_AF15
#define EVENTOUT_PE4_ PE4,GPIO_AF15
#define EVENTOUT_PE5_ PE5,GPIO_AF15
#define EVENTOUT_PE6_ PE6,GPIO_AF15
#define EVENTOUT_PE7_ PE7,GPIO_AF15
#define EVENTOUT_PE8_ PE8,GPIO_AF15
#define EVENTOUT_PE9_ PE9,GPIO_AF15
#define EVENTOUT_PF0_ PF0,GPIO_AF15
#define EVENTOUT_PF1_ PF1,GPIO_AF15
#define EVENTOUT_PF10_ PF10,GPIO_AF15
#define EVENTOUT_PF11_ PF11,GPIO_AF15
#define EVENTOUT_PF12_ PF12,GPIO_AF15
#define EVENTOUT_PF13_ PF13,GPIO_AF15
#define EVENTOUT_PF14_ PF14,GPIO_AF15
#define EVENTOUT_PF15_ PF15,GPIO_AF15
#define EVENTOUT_PF2_ PF2,GPIO_AF15
#define EVENTOUT_PF3_ PF3,GPIO_AF15
#define EVENTOUT_PF4_ PF4,GPIO_AF15
#define EVENTOUT_PF5_ PF5,GPIO_AF15
#define EVENTOUT_PF6_ PF6,GPIO_AF15
#define EVENTOUT_PF7_ PF7,GPIO_AF15
#define EVENTOUT_PF8_ PF8,GPIO_AF15
#define EVENTOUT_PF9_ PF9,GPIO_AF15
#define EVENTOUT_PG0_ PG0,GPIO_AF15
#define EVENTOUT_PG1_ PG1,GPIO_AF15
#define EVENTOUT_PG10_ PG10,GPIO_AF15
#define EVENTOUT_PG11_ PG11,GPIO_AF15
#define EVENTOUT_PG12_ PG12,GPIO_AF15
#define EVENTOUT_PG13_ PG13,GPIO_AF15
#define EVENTOUT_PG14_ PG14,GPIO_AF15
#define EVENTOUT_PG15_ PG15,GPIO_AF15
#define EVENTOUT_PG2_ PG2,GPIO_AF15
#define EVENTOUT_PG3_ PG3,GPIO_AF15
#define EVENTOUT_PG4_ PG4,GPIO_AF15
#define EVENTOUT_PG5_ PG5,GPIO_AF15
#define EVENTOUT_PG6_ PG6,GPIO_AF15
#define EVENTOUT_PG7_ PG7,GPIO_AF15
#define EVENTOUT_PG8_ PG8,GPIO_AF15
#define EVENTOUT_PG9_ PG9,GPIO_AF15
#define EVENTOUT_PH0_ PH0,GPIO_AF15
#define EVENTOUT_PH1_ PH1,GPIO_AF15
#define EVENTOUT_PH10_ PH10,GPIO_AF15
#define EVENTOUT_PH11_ PH11,GPIO_AF15
#define EVENTOUT_PH12_ PH12,GPIO_AF15
#define EVENTOUT_PH13_ PH13,GPIO_AF15
#define EVENTOUT_PH14_ PH14,GPIO_AF15
#define EVENTOUT_PH15_ PH15,GPIO_AF15
#define EVENTOUT_PH2_ PH2,GPIO_AF15
#define EVENTOUT_PH3_ PH3,GPIO_AF15
#define EVENTOUT_PH4_ PH4,GPIO_AF15
#define EVENTOUT_PH5_ PH5,GPIO_AF15
#define EVENTOUT_PH6_ PH6,GPIO_AF15
#define EVENTOUT_PH7_ PH7,GPIO_AF15
#define EVENTOUT_PH8_ PH8,GPIO_AF15
#define EVENTOUT_PH9_ PH9,GPIO_AF15
#define EVENTOUT_PI0_ PI0,GPIO_AF15
#define EVENTOUT_PI1_ PI1,GPIO_AF15
#define EVENTOUT_PI10_ PI10,GPIO_AF15
#define EVENTOUT_PI11_ PI11,GPIO_AF15
#define EVENTOUT_PI12_ PI12,GPIO_AF15
#define EVENTOUT_PI13_ PI13,GPIO_AF15
#define EVENTOUT_PI14_ PI14,GPIO_AF15
#define EVENTOUT_PI15_ PI15,GPIO_AF15
#define EVENTOUT_PI2_ PI2,GPIO_AF15
#define EVENTOUT_PI3_ PI3,GPIO_AF15
#define EVENTOUT_PI4_ PI4,GPIO_AF15
#define EVENTOUT_PI5_ PI5,GPIO_AF15
#define EVENTOUT_PI6_ PI6,GPIO_AF15
#define EVENTOUT_PI7_ PI7,GPIO_AF15
#define EVENTOUT_PI8_ PI8,GPIO_AF15
#define EVENTOUT_PI9_ PI9,GPIO_AF15
#define EVENTOUT_PJ0_ PJ0,GPIO_AF15
#define EVENTOUT_PJ1_ PJ1,GPIO_AF15
#define EVENTOUT_PJ10_ PJ10,GPIO_AF15
#define EVENTOUT_PJ11_ PJ11,GPIO_AF15
#define EVENTOUT_PJ12_ PJ12,GPIO_AF15
#define EVENTOUT_PJ13_ PJ13,GPIO_AF15
#define EVENTOUT_PJ14_ PJ14,GPIO_AF15
#define EVENTOUT_PJ15_ PJ15,GPIO_AF15
#define EVENTOUT_PJ2_ PJ2,GPIO_AF15
#define EVENTOUT_PJ3_ PJ3,GPIO_AF15
#define EVENTOUT_PJ4_ PJ4,GPIO_AF15
#define EVENTOUT_PJ5_ PJ5,GPIO_AF15
#define EVENTOUT_PJ6_ PJ6,GPIO_AF15
#define EVENTOUT_PJ7_ PJ7,GPIO_AF15
#define EVENTOUT_PJ8_ PJ8,GPIO_AF15
#define EVENTOUT_PJ9_ PJ9,GPIO_AF15
#define EVENTOUT_PK0_ PK0,GPIO_AF15
#define EVENTOUT_PK1_ PK1,GPIO_AF15
#define EVENTOUT_PK2_ PK2,GPIO_AF15
#define EVENTOUT_PK3_ PK3,GPIO_AF15
#define EVENTOUT_PK4_ PK4,GPIO_AF15
#define EVENTOUT_PK5_ PK5,GPIO_AF15
#define EVENTOUT_PK6_ PK6,GPIO_AF15
#define EVENTOUT_PK7_ PK7,GPIO_AF15
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA0_C_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13_ 1
#define _EVENTOUT_PA14_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA1_C_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC13_ 1
#define _EVENTOUT_PC14_ 1
#define _EVENTOUT_PC15_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC2_C_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC3_C_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PD0_ 1
#define _EVENTOUT_PD1_ 1
#define _EVENTOUT_PD10_ 1
#define _EVENTOUT_PD11_ 1
#define _EVENTOUT_PD12_ 1
#define _EVENTOUT_PD13_ 1
#define _EVENTOUT_PD14_ 1
#define _EVENTOUT_PD15_ 1
#define _EVENTOUT_PD2_ 1
#define _EVENTOUT_PD3_ 1
#define _EVENTOUT_PD4_ 1
#define _EVENTOUT_PD5_ 1
#define _EVENTOUT_PD6_ 1
#define _EVENTOUT_PD7_ 1
#define _EVENTOUT_PD8_ 1
#define _EVENTOUT_PD9_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PE10_ 1
#define _EVENTOUT_PE11_ 1
#define _EVENTOUT_PE12_ 1
#define _EVENTOUT_PE13_ 1
#define _EVENTOUT_PE14_ 1
#define _EVENTOUT_PE15_ 1
#define _EVENTOUT_PE2_ 1
#define _EVENTOUT_PE3_ 1
#define _EVENTOUT_PE4_ 1
#define _EVENTOUT_PE5_ 1
#define _EVENTOUT_PE6_ 1
#define _EVENTOUT_PE7_ 1
#define _EVENTOUT_PE8_ 1
#define _EVENTOUT_PE9_ 1
#define _EVENTOUT_PF0_ 1
#define _EVENTOUT_PF1_ 1
#define _EVENTOUT_PF10_ 1
#define _EVENTOUT_PF11_ 1
#define _EVENTOUT_PF12_ 1
#define _EVENTOUT_PF13_ 1
#define _EVENTOUT_PF14_ 1
#define _EVENTOUT_PF15_ 1
#define _EVENTOUT_PF2_ 1
#define _EVENTOUT_PF3_ 1
#define _EVENTOUT_PF4_ 1
#define _EVENTOUT_PF5_ 1
#define _EVENTOUT_PF6_ 1
#define _EVENTOUT_PF7_ 1
#define _EVENTOUT_PF8_ 1
#define _EVENTOUT_PF9_ 1
#define _EVENTOUT_PG0_ 1
#define _EVENTOUT_PG1_ 1
#define _EVENTOUT_PG10_ 1
#define _EVENTOUT_PG11_ 1
#define _EVENTOUT_PG12_ 1
#define _EVENTOUT_PG13_ 1
#define _EVENTOUT_PG14_ 1
#define _EVENTOUT_PG15_ 1
#define _EVENTOUT_PG2_ 1
#define _EVENTOUT_PG3_ 1
#define _EVENTOUT_PG4_ 1
#define _EVENTOUT_PG5_ 1
#define _EVENTOUT_PG6_ 1
#define _EVENTOUT_PG7_ 1
#define _EVENTOUT_PG8_ 1
#define _EVENTOUT_PG9_ 1
#define _EVENTOUT_PH0_ 1
#define _EVENTOUT_PH1_ 1
#define _EVENTOUT_PH10_ 1
#define _EVENTOUT_PH11_ 1
#define _EVENTOUT_PH12_ 1
#define _EVENTOUT_PH13_ 1
#define _EVENTOUT_PH14_ 1
#define _EVENTOUT_PH15_ 1
#define _EVENTOUT_PH2_ 1
#define _EVENTOUT_PH3_ 1
#define _EVENTOUT_PH4_ 1
#define _EVENTOUT_PH5_ 1
#define _EVENTOUT_PH6_ 1
#define _EVENTOUT_PH7_ 1
#define _EVENTOUT_PH8_ 1
#define _EVENTOUT_PH9_ 1
#define _EVENTOUT_PI0_ 1
#define _EVENTOUT_PI1_ 1
#define _EVENTOUT_PI10_ 1
#define _EVENTOUT_PI11_ 1
#define _EVENTOUT_PI12_ 1
#define _EVENTOUT_PI13_ 1
#define _EVENTOUT_PI14_ 1
#define _EVENTOUT_PI15_ 1
#define _EVENTOUT_PI2_ 1
#define _EVENTOUT_PI3_ 1
#define _EVENTOUT_PI4_ 1
#define _EVENTOUT_PI5_ 1
#define _EVENTOUT_PI6_ 1
#define _EVENTOUT_PI7_ 1
#define _EVENTOUT_PI8_ 1
#define _EVENTOUT_PI9_ 1
#define _EVENTOUT_PJ0_ 1
#define _EVENTOUT_PJ1_ 1
#define _EVENTOUT_PJ10_ 1
#define _EVENTOUT_PJ11_ 1
#define _EVENTOUT_PJ12_ 1
#define _EVENTOUT_PJ13_ 1
#define _EVENTOUT_PJ14_ 1
#define _EVENTOUT_PJ15_ 1
#define _EVENTOUT_PJ2_ 1
#define _EVENTOUT_PJ3_ 1
#define _EVENTOUT_PJ4_ 1
#define _EVENTOUT_PJ5_ 1
#define _EVENTOUT_PJ6_ 1
#define _EVENTOUT_PJ7_ 1
#define _EVENTOUT_PJ8_ 1
#define _EVENTOUT_PJ9_ 1
#define _EVENTOUT_PK0_ 1
#define _EVENTOUT_PK1_ 1
#define _EVENTOUT_PK2_ 1
#define _EVENTOUT_PK3_ 1
#define _EVENTOUT_PK4_ 1
#define _EVENTOUT_PK5_ 1
#define _EVENTOUT_PK6_ 1
#define _EVENTOUT_PK7_ 1

#define FDCAN1_RX_PA11_ PA11,GPIO_AF9
#define FDCAN1_RX_PB8_ PB8,GPIO_AF9
#define FDCAN1_RX_PD0_ PD0,GPIO_AF9
#define FDCAN1_RX_PH14_ PH14,GPIO_AF9
#define FDCAN1_RX_PI9_ PI9,GPIO_AF9
#define _FDCAN1_RX_PA11_ 1
#define _FDCAN1_RX_PB8_ 1
#define _FDCAN1_RX_PD0_ 1
#define _FDCAN1_RX_PH14_ 1
#define _FDCAN1_RX_PI9_ 1

#define FDCAN1_TX_PA12_ PA12,GPIO_AF9
#define FDCAN1_TX_PB9_ PB9,GPIO_AF9
#define FDCAN1_TX_PD1_ PD1,GPIO_AF9
#define FDCAN1_TX_PH13_ PH13,GPIO_AF9
#define _FDCAN1_TX_PA12_ 1
#define _FDCAN1_TX_PB9_ 1
#define _FDCAN1_TX_PD1_ 1
#define _FDCAN1_TX_PH13_ 1

#define FDCAN2_RX_PB12_ PB12,GPIO_AF9
#define FDCAN2_RX_PB5_ PB5,GPIO_AF9
#define _FDCAN2_RX_PB12_ 1
#define _FDCAN2_RX_PB5_ 1

#define FDCAN2_TX_PB13_ PB13,GPIO_AF9
#define FDCAN2_TX_PB6_ PB6,GPIO_AF9
#define _FDCAN2_TX_PB13_ 1
#define _FDCAN2_TX_PB6_ 1

