susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H7A2.h
#define I2S6_MCK_PA3_ PA3,GPIO_AF5
#define _I2S6_MCK_PA3_ 1

#define I2S6_SDI_PA6_ PA6,GPIO_AF8
#define I2S6_SDI_PB4_ PB4,GPIO_AF8
#define I2S6_SDI_PG12_ PG12,GPIO_AF5
#define _I2S6_SDI_PA6_ 1
#define _I2S6_SDI_PB4_ 1
#define _I2S6_SDI_PG12_ 1

#define I2S6_SDO_PA7_ PA7,GPIO_AF8
#define I2S6_SDO_PB5_ PB5,GPIO_AF8
#define I2S6_SDO_PG14_ PG14,GPIO_AF5
#define _I2S6_SDO_PA7_ 1
#define _I2S6_SDO_PB5_ 1
#define _I2S6_SDO_PG14_ 1

#define I2S6_WS_PA0_ PA0,GPIO_AF5
#define I2S6_WS_PA0_C_ PA0_C,GPIO_AF5
#define I2S6_WS_PA15_ PA15,GPIO_AF7
#define I2S6_WS_PA4_ PA4,GPIO_AF8
#define I2S6_WS_PG8_ PG8,GPIO_AF5
#define _I2S6_WS_PA0_ 1
#define _I2S6_WS_PA0_C_ 1
#define _I2S6_WS_PA15_ 1
#define _I2S6_WS_PA4_ 1
#define _I2S6_WS_PG8_ 1

#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PC9_ 1

#define LPTIM1_ETR_PE0_ PE0,GPIO_AF1
#define LPTIM1_ETR_PG14_ PG14,GPIO_AF1
#define _LPTIM1_ETR_PE0_ 1
#define _LPTIM1_ETR_PG14_ 1

#define LPTIM1_IN1_PD12_ PD12,GPIO_AF1
#define LPTIM1_IN1_PG12_ PG12,GPIO_AF1
#define _LPTIM1_IN1_PD12_ 1
#define _LPTIM1_IN1_PG12_ 1

#define LPTIM1_IN2_PE1_ PE1,GPIO_AF1
#define LPTIM1_IN2_PG11_ PG11,GPIO_AF1
#define LPTIM1_IN2_PH2_ PH2,GPIO_AF1
#define _LPTIM1_IN2_PE1_ 1
#define _LPTIM1_IN2_PG11_ 1
#define _LPTIM1_IN2_PH2_ 1

#define LPTIM1_OUT_PD13_ PD13,GPIO_AF1
#define LPTIM1_OUT_PG13_ PG13,GPIO_AF1
#define _LPTIM1_OUT_PD13_ 1
#define _LPTIM1_OUT_PG13_ 1

#define LPTIM2_ETR_PB11_ PB11,GPIO_AF3
#define LPTIM2_ETR_PE0_ PE0,GPIO_AF4
#define _LPTIM2_ETR_PB11_ 1
#define _LPTIM2_ETR_PE0_ 1

#define LPTIM2_IN1_PB10_ PB10,GPIO_AF3
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF3
#define _LPTIM2_IN1_PB10_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_IN2_PD11_ PD11,GPIO_AF3
#define _LPTIM2_IN2_PD11_ 1

#define LPTIM2_OUT_PB13_ PB13,GPIO_AF3
#define _LPTIM2_OUT_PB13_ 1

#define LPTIM3_OUT_PA1_ PA1,GPIO_AF3
#define LPTIM3_OUT_PA1_C_ PA1_C,GPIO_AF3
#define _LPTIM3_OUT_PA1_ 1
#define _LPTIM3_OUT_PA1_C_ 1

#define LPUART1_CTS_PA11_ PA11,GPIO_AF3
#define _LPUART1_CTS_PA11_ 1

#define LPUART1_DE_PA12_ PA12,GPIO_AF3
#define _LPUART1_DE_PA12_ 1

#define LPUART1_RTS_PA12_ PA12,GPIO_AF3
#define _LPUART1_RTS_PA12_ 1

#define LPUART1_RX_PA10_ PA10,GPIO_AF3
#define LPUART1_RX_PB7_ PB7,GPIO_AF8
#define _LPUART1_RX_PA10_ 1
#define _LPUART1_RX_PB7_ 1

#define LPUART1_TX_PA9_ PA9,GPIO_AF3
#define LPUART1_TX_PB6_ PB6,GPIO_AF8
#define _LPUART1_TX_PA9_ 1
#define _LPUART1_TX_PB6_ 1

#define LTDC_B0_PE4_ PE4,GPIO_AF14
#define LTDC_B0_PG14_ PG14,GPIO_AF14
#define LTDC_B0_PJ12_ PJ12,GPIO_AF14
#define _LTDC_B0_PE4_ 1
#define _LTDC_B0_PG14_ 1
#define _LTDC_B0_PJ12_ 1

#define LTDC_B1_PA10_ PA10,GPIO_AF14
#define LTDC_B1_PC10_ PC10,GPIO_AF10
#define LTDC_B1_PD0_ PD0,GPIO_AF14
#define LTDC_B1_PG12_ PG12,GPIO_AF14
#define LTDC_B1_PJ13_ PJ13,GPIO_AF14
#define _LTDC_B1_PA10_ 1
#define _LTDC_B1_PC10_ 1
#define _LTDC_B1_PD0_ 1
#define _LTDC_B1_PG12_ 1
#define _LTDC_B1_PJ13_ 1

#define LTDC_B2_PA3_ PA3,GPIO_AF9
#define LTDC_B2_PC9_ PC9,GPIO_AF14
#define LTDC_B2_PD2_ PD2,GPIO_AF14
#define LTDC_B2_PD6_ PD6,GPIO_AF14
#define LTDC_B2_PG10_ PG10,GPIO_AF14
#define LTDC_B2_PJ14_ PJ14,GPIO_AF14
#define _LTDC_B2_PA3_ 1
#define _LTDC_B2_PC9_ 1
#define _LTDC_B2_PD2_ 1
#define _LTDC_B2_PD6_ 1
#define _LTDC_B2_PG10_ 1
#define _LTDC_B2_PJ14_ 1

#define LTDC_B3_PA8_ PA8,GPIO_AF13
#define LTDC_B3_PD10_ PD10,GPIO_AF14
#define LTDC_B3_PG11_ PG11,GPIO_AF14
#define LTDC_B3_PJ15_ PJ15,GPIO_AF14
#define _LTDC_B3_PA8_ 1
#define _LTDC_B3_PD10_ 1
#define _LTDC_B3_PG11_ 1
#define _LTDC_B3_PJ15_ 1

#define LTDC_B4_PA10_ PA10,GPIO_AF12
#define LTDC_B4_PC11_ PC11,GPIO_AF14
#define LTDC_B4_PE12_ PE12,GPIO_AF14
#define LTDC_B4_PG12_ PG12,GPIO_AF9
#define LTDC_B4_PI4_ PI4,GPIO_AF14
#define LTDC_B4_PJ13_ PJ13,GPIO_AF9
#define LTDC_B4_PK3_ PK3,GPIO_AF14
#define _LTDC_B4_PA10_ 1
#define _LTDC_B4_PC11_ 1
#define _LTDC_B4_PE12_ 1
#define _LTDC_B4_PG12_ 1
#define _LTDC_B4_PI4_ 1
#define _LTDC_B4_PJ13_ 1
#define _LTDC_B4_PK3_ 1

#define LTDC_B5_PA3_ PA3,GPIO_AF14
#define LTDC_B5_PB5_ PB5,GPIO_AF11
#define LTDC_B5_PI5_ PI5,GPIO_AF14
#define LTDC_B5_PK4_ PK4,GPIO_AF14
#define _LTDC_B5_PA3_ 1
#define _LTDC_B5_PB5_ 1
#define _LTDC_B5_PI5_ 1
#define _LTDC_B5_PK4_ 1

#define LTDC_B6_PA15_ PA15,GPIO_AF14
#define LTDC_B6_PB8_ PB8,GPIO_AF14
#define LTDC_B6_PI6_ PI6,GPIO_AF14
#define LTDC_B6_PK5_ PK5,GPIO_AF14
#define _LTDC_B6_PA15_ 1
#define _LTDC_B6_PB8_ 1
#define _LTDC_B6_PI6_ 1
#define _LTDC_B6_PK5_ 1

#define LTDC_B7_PB9_ PB9,GPIO_AF14
#define LTDC_B7_PD2_ PD2,GPIO_AF9
#define LTDC_B7_PI7_ PI7,GPIO_AF14
#define LTDC_B7_PK6_ PK6,GPIO_AF14
#define _LTDC_B7_PB9_ 1
#define _LTDC_B7_PD2_ 1
#define _LTDC_B7_PI7_ 1
#define _LTDC_B7_PK6_ 1

#define LTDC_CLK_PB14_ PB14,GPIO_AF14
#define LTDC_CLK_PE14_ PE14,GPIO_AF14
#define LTDC_CLK_PG7_ PG7,GPIO_AF14
#define LTDC_CLK_PI14_ PI14,GPIO_AF14
#define _LTDC_CLK_PB14_ 1
#define _LTDC_CLK_PE14_ 1
#define _LTDC_CLK_PG7_ 1
#define _LTDC_CLK_PI14_ 1

#define LTDC_DE_PC5_ PC5,GPIO_AF14
#define LTDC_DE_PE13_ PE13,GPIO_AF14
#define LTDC_DE_PF10_ PF10,GPIO_AF14
#define LTDC_DE_PK7_ PK7,GPIO_AF14
#define _LTDC_DE_PC5_ 1
#define _LTDC_DE_PE13_ 1
#define _LTDC_DE_PF10_ 1
#define _LTDC_DE_PK7_ 1

#define LTDC_G0_PB1_ PB1,GPIO_AF14
#define LTDC_G0_PE5_ PE5,GPIO_AF14
#define LTDC_G0_PJ7_ PJ7,GPIO_AF14
#define _LTDC_G0_PB1_ 1
#define _LTDC_G0_PE5_ 1
#define _LTDC_G0_PJ7_ 1

#define LTDC_G1_PB0_ PB0,GPIO_AF14
#define LTDC_G1_PE6_ PE6,GPIO_AF14
#define LTDC_G1_PJ8_ PJ8,GPIO_AF14
#define _LTDC_G1_PB0_ 1
#define _LTDC_G1_PE6_ 1
#define _LTDC_G1_PJ8_ 1

#define LTDC_G2_PA6_ PA6,GPIO_AF14
#define LTDC_G2_PC0_ PC0,GPIO_AF11
#define LTDC_G2_PH13_ PH13,GPIO_AF14
#define LTDC_G2_PI15_ PI15,GPIO_AF9
#define LTDC_G2_PJ9_ PJ9,GPIO_AF14
#define _LTDC_G2_PA6_ 1
#define _LTDC_G2_PC0_ 1
#define _LTDC_G2_PH13_ 1
#define _LTDC_G2_PI15_ 1
#define _LTDC_G2_PJ9_ 1

#define LTDC_G3_PC9_ PC9,GPIO_AF10
#define LTDC_G3_PE11_ PE11,GPIO_AF14
#define LTDC_G3_PG10_ PG10,GPIO_AF9
#define LTDC_G3_PH14_ PH14,GPIO_AF14
#define LTDC_G3_PJ10_ PJ10,GPIO_AF14
#define LTDC_G3_PJ12_ PJ12,GPIO_AF9
#define _LTDC_G3_PC9_ 1
#define _LTDC_G3_PE11_ 1
#define _LTDC_G3_PG10_ 1
#define _LTDC_G3_PH14_ 1
#define _LTDC_G3_PJ10_ 1
#define _LTDC_G3_PJ12_ 1

#define LTDC_G4_PB10_ PB10,GPIO_AF14
#define LTDC_G4_PH15_ PH15,GPIO_AF14
#define LTDC_G4_PH4_ PH4,GPIO_AF14
#define LTDC_G4_PJ11_ PJ11,GPIO_AF14
#define _LTDC_G4_PB10_ 1
#define _LTDC_G4_PH15_ 1
#define _LTDC_G4_PH4_ 1
#define _LTDC_G4_PJ11_ 1

#define LTDC_G5_PB11_ PB11,GPIO_AF14
#define LTDC_G5_PC1_ PC1,GPIO_AF14
#define LTDC_G5_PH4_ PH4,GPIO_AF9
#define LTDC_G5_PI0_ PI0,GPIO_AF14
#define LTDC_G5_PK0_ PK0,GPIO_AF14
#define _LTDC_G5_PB11_ 1
#define _LTDC_G5_PC1_ 1
#define _LTDC_G5_PH4_ 1
#define _LTDC_G5_PI0_ 1
#define _LTDC_G5_PK0_ 1

#define LTDC_G6_PC7_ PC7,GPIO_AF14
#define LTDC_G6_PI1_ PI1,GPIO_AF14
#define LTDC_G6_PI11_ PI11,GPIO_AF9
#define LTDC_G6_PK1_ PK1,GPIO_AF14
#define _LTDC_G6_PC7_ 1
#define _LTDC_G6_PI1_ 1
#define _LTDC_G6_PI11_ 1
#define _LTDC_G6_PK1_ 1

#define LTDC_G7_PB15_ PB15,GPIO_AF14
#define LTDC_G7_PD3_ PD3,GPIO_AF14
#define LTDC_G7_PG8_ PG8,GPIO_AF14
#define LTDC_G7_PI2_ PI2,GPIO_AF14
#define LTDC_G7_PK2_ PK2,GPIO_AF14
#define _LTDC_G7_PB15_ 1
#define _LTDC_G7_PD3_ 1
#define _LTDC_G7_PG8_ 1
#define _LTDC_G7_PI2_ 1
#define _LTDC_G7_PK2_ 1

#define LTDC_HSYNC_PC6_ PC6,GPIO_AF14
#define LTDC_HSYNC_PI10_ PI10,GPIO_AF14
#define LTDC_HSYNC_PI12_ PI12,GPIO_AF14
#define _LTDC_HSYNC_PC6_ 1
#define _LTDC_HSYNC_PI10_ 1
#define _LTDC_HSYNC_PI12_ 1

#define LTDC_R0_PE0_ PE0,GPIO_AF14
#define LTDC_R0_PG13_ PG13,GPIO_AF14
#define LTDC_R0_PH2_ PH2,GPIO_AF14
#define LTDC_R0_PI15_ PI15,GPIO_AF14
#define _LTDC_R0_PE0_ 1
#define _LTDC_R0_PG13_ 1
#define _LTDC_R0_PH2_ 1
#define _LTDC_R0_PI15_ 1

#define LTDC_R1_PA2_ PA2,GPIO_AF14
#define LTDC_R1_PH3_ PH3,GPIO_AF14
#define LTDC_R1_PJ0_ PJ0,GPIO_AF14
#define _LTDC_R1_PA2_ 1
#define _LTDC_R1_PH3_ 1
#define _LTDC_R1_PJ0_ 1

#define LTDC_R2_PA1_ PA1,GPIO_AF14
#define LTDC_R2_PA1_C_ PA1_C,GPIO_AF14
#define LTDC_R2_PC10_ PC10,GPIO_AF14
#define LTDC_R2_PH8_ PH8,GPIO_AF14
#define LTDC_R2_PJ1_ PJ1,GPIO_AF14
#define _LTDC_R2_PA1_ 1
#define _LTDC_R2_PA1_C_ 1
#define _LTDC_R2_PC10_ 1
#define _LTDC_R2_PH8_ 1
#define _LTDC_R2_PJ1_ 1

