susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H7A2.h
#define LTDC_R3_PA15_ PA15,GPIO_AF9
#define LTDC_R3_PB0_ PB0,GPIO_AF9
#define LTDC_R3_PH9_ PH9,GPIO_AF14
#define LTDC_R3_PJ2_ PJ2,GPIO_AF14
#define _LTDC_R3_PA15_ 1
#define _LTDC_R3_PB0_ 1
#define _LTDC_R3_PH9_ 1
#define _LTDC_R3_PJ2_ 1

#define LTDC_R4_PA11_ PA11,GPIO_AF14
#define LTDC_R4_PA5_ PA5,GPIO_AF14
#define LTDC_R4_PH10_ PH10,GPIO_AF14
#define LTDC_R4_PJ3_ PJ3,GPIO_AF14
#define _LTDC_R4_PA11_ 1
#define _LTDC_R4_PA5_ 1
#define _LTDC_R4_PH10_ 1
#define _LTDC_R4_PJ3_ 1

#define LTDC_R5_PA12_ PA12,GPIO_AF14
#define LTDC_R5_PA9_ PA9,GPIO_AF14
#define LTDC_R5_PC0_ PC0,GPIO_AF14
#define LTDC_R5_PH11_ PH11,GPIO_AF14
#define LTDC_R5_PJ4_ PJ4,GPIO_AF14
#define _LTDC_R5_PA12_ 1
#define _LTDC_R5_PA9_ 1
#define _LTDC_R5_PC0_ 1
#define _LTDC_R5_PH11_ 1
#define _LTDC_R5_PJ4_ 1

#define LTDC_R6_PA8_ PA8,GPIO_AF14
#define LTDC_R6_PB1_ PB1,GPIO_AF9
#define LTDC_R6_PC12_ PC12,GPIO_AF14
#define LTDC_R6_PE1_ PE1,GPIO_AF14
#define LTDC_R6_PH12_ PH12,GPIO_AF14
#define LTDC_R6_PJ5_ PJ5,GPIO_AF14
#define _LTDC_R6_PA8_ 1
#define _LTDC_R6_PB1_ 1
#define _LTDC_R6_PC12_ 1
#define _LTDC_R6_PE1_ 1
#define _LTDC_R6_PH12_ 1
#define _LTDC_R6_PJ5_ 1

#define LTDC_R7_PC4_ PC4,GPIO_AF14
#define LTDC_R7_PE15_ PE15,GPIO_AF14
#define LTDC_R7_PG6_ PG6,GPIO_AF14
#define LTDC_R7_PJ0_ PJ0,GPIO_AF9
#define LTDC_R7_PJ6_ PJ6,GPIO_AF14
#define _LTDC_R7_PC4_ 1
#define _LTDC_R7_PE15_ 1
#define _LTDC_R7_PG6_ 1
#define _LTDC_R7_PJ0_ 1
#define _LTDC_R7_PJ6_ 1

#define LTDC_VSYNC_PA4_ PA4,GPIO_AF14
#define LTDC_VSYNC_PA7_ PA7,GPIO_AF14
#define LTDC_VSYNC_PI13_ PI13,GPIO_AF14
#define LTDC_VSYNC_PI9_ PI9,GPIO_AF14
#define _LTDC_VSYNC_PA4_ 1
#define _LTDC_VSYNC_PA7_ 1
#define _LTDC_VSYNC_PI13_ 1
#define _LTDC_VSYNC_PI9_ 1

#define MDIOS_MDC_PA6_ PA6,GPIO_AF11
#define MDIOS_MDC_PC1_ PC1,GPIO_AF12
#define _MDIOS_MDC_PA6_ 1
#define _MDIOS_MDC_PC1_ 1

#define MDIOS_MDIO_PA10_ PA10,GPIO_AF11
#define MDIOS_MDIO_PA2_ PA2,GPIO_AF12
#define _MDIOS_MDIO_PA10_ 1
#define _MDIOS_MDIO_PA2_ 1

#define OCTOSPIM_P1_CLK_PA3_ PA3,GPIO_AF3
#define OCTOSPIM_P1_CLK_PB2_ PB2,GPIO_AF9
#define OCTOSPIM_P1_CLK_PF10_ PF10,GPIO_AF9
#define _OCTOSPIM_P1_CLK_PA3_ 1
#define _OCTOSPIM_P1_CLK_PB2_ 1
#define _OCTOSPIM_P1_CLK_PF10_ 1

#define OCTOSPIM_P1_DQS_PA1_ PA1,GPIO_AF11
#define OCTOSPIM_P1_DQS_PA1_C_ PA1_C,GPIO_AF11
#define OCTOSPIM_P1_DQS_PB2_ PB2,GPIO_AF10
#define OCTOSPIM_P1_DQS_PC5_ PC5,GPIO_AF10
#define _OCTOSPIM_P1_DQS_PA1_ 1
#define _OCTOSPIM_P1_DQS_PA1_C_ 1
#define _OCTOSPIM_P1_DQS_PB2_ 1
#define _OCTOSPIM_P1_DQS_PC5_ 1

#define OCTOSPIM_P1_IO0_PB1_ PB1,GPIO_AF11
#define OCTOSPIM_P1_IO0_PC3_ PC3,GPIO_AF9
#define OCTOSPIM_P1_IO0_PC3_C_ PC3_C,GPIO_AF9
#define OCTOSPIM_P1_IO0_PC9_ PC9,GPIO_AF9
#define OCTOSPIM_P1_IO0_PD11_ PD11,GPIO_AF9
#define OCTOSPIM_P1_IO0_PF8_ PF8,GPIO_AF10
#define _OCTOSPIM_P1_IO0_PB1_ 1
#define _OCTOSPIM_P1_IO0_PC3_ 1
#define _OCTOSPIM_P1_IO0_PC3_C_ 1
#define _OCTOSPIM_P1_IO0_PC9_ 1
#define _OCTOSPIM_P1_IO0_PD11_ 1
#define _OCTOSPIM_P1_IO0_PF8_ 1

#define OCTOSPIM_P1_IO1_PB0_ PB0,GPIO_AF11
#define OCTOSPIM_P1_IO1_PC10_ PC10,GPIO_AF9
#define OCTOSPIM_P1_IO1_PD12_ PD12,GPIO_AF9
#define OCTOSPIM_P1_IO1_PF9_ PF9,GPIO_AF10
#define _OCTOSPIM_P1_IO1_PB0_ 1
#define _OCTOSPIM_P1_IO1_PC10_ 1
#define _OCTOSPIM_P1_IO1_PD12_ 1
#define _OCTOSPIM_P1_IO1_PF9_ 1

#define OCTOSPIM_P1_IO2_PA7_ PA7,GPIO_AF10
#define OCTOSPIM_P1_IO2_PC2_ PC2,GPIO_AF9
#define OCTOSPIM_P1_IO2_PC2_C_ PC2_C,GPIO_AF9
#define OCTOSPIM_P1_IO2_PE2_ PE2,GPIO_AF9
#define OCTOSPIM_P1_IO2_PF7_ PF7,GPIO_AF10
#define _OCTOSPIM_P1_IO2_PA7_ 1
#define _OCTOSPIM_P1_IO2_PC2_ 1
#define _OCTOSPIM_P1_IO2_PC2_C_ 1
#define _OCTOSPIM_P1_IO2_PE2_ 1
#define _OCTOSPIM_P1_IO2_PF7_ 1

#define OCTOSPIM_P1_IO3_PA1_ PA1,GPIO_AF9
#define OCTOSPIM_P1_IO3_PA1_C_ PA1_C,GPIO_AF9
#define OCTOSPIM_P1_IO3_PA6_ PA6,GPIO_AF6
#define OCTOSPIM_P1_IO3_PD13_ PD13,GPIO_AF9
#define OCTOSPIM_P1_IO3_PF6_ PF6,GPIO_AF10
#define _OCTOSPIM_P1_IO3_PA1_ 1
#define _OCTOSPIM_P1_IO3_PA1_C_ 1
#define _OCTOSPIM_P1_IO3_PA6_ 1
#define _OCTOSPIM_P1_IO3_PD13_ 1
#define _OCTOSPIM_P1_IO3_PF6_ 1

#define OCTOSPIM_P1_IO4_PC1_ PC1,GPIO_AF10
#define OCTOSPIM_P1_IO4_PD4_ PD4,GPIO_AF10
#define OCTOSPIM_P1_IO4_PE7_ PE7,GPIO_AF10
#define OCTOSPIM_P1_IO4_PH2_ PH2,GPIO_AF9
#define _OCTOSPIM_P1_IO4_PC1_ 1
#define _OCTOSPIM_P1_IO4_PD4_ 1
#define _OCTOSPIM_P1_IO4_PE7_ 1
#define _OCTOSPIM_P1_IO4_PH2_ 1

#define OCTOSPIM_P1_IO5_PC2_ PC2,GPIO_AF11
#define OCTOSPIM_P1_IO5_PC2_C_ PC2_C,GPIO_AF11
#define OCTOSPIM_P1_IO5_PD5_ PD5,GPIO_AF10
#define OCTOSPIM_P1_IO5_PE8_ PE8,GPIO_AF10
#define OCTOSPIM_P1_IO5_PH3_ PH3,GPIO_AF9
#define _OCTOSPIM_P1_IO5_PC2_ 1
#define _OCTOSPIM_P1_IO5_PC2_C_ 1
#define _OCTOSPIM_P1_IO5_PD5_ 1
#define _OCTOSPIM_P1_IO5_PE8_ 1
#define _OCTOSPIM_P1_IO5_PH3_ 1

#define OCTOSPIM_P1_IO6_PC3_ PC3,GPIO_AF11
#define OCTOSPIM_P1_IO6_PC3_C_ PC3_C,GPIO_AF11
#define OCTOSPIM_P1_IO6_PD6_ PD6,GPIO_AF10
#define OCTOSPIM_P1_IO6_PE9_ PE9,GPIO_AF10
#define OCTOSPIM_P1_IO6_PG9_ PG9,GPIO_AF9
#define _OCTOSPIM_P1_IO6_PC3_ 1
#define _OCTOSPIM_P1_IO6_PC3_C_ 1
#define _OCTOSPIM_P1_IO6_PD6_ 1
#define _OCTOSPIM_P1_IO6_PE9_ 1
#define _OCTOSPIM_P1_IO6_PG9_ 1

#define OCTOSPIM_P1_IO7_PD7_ PD7,GPIO_AF10
#define OCTOSPIM_P1_IO7_PE10_ PE10,GPIO_AF10
#define OCTOSPIM_P1_IO7_PG14_ PG14,GPIO_AF9
#define _OCTOSPIM_P1_IO7_PD7_ 1
#define _OCTOSPIM_P1_IO7_PE10_ 1
#define _OCTOSPIM_P1_IO7_PG14_ 1

#define OCTOSPIM_P1_NCLK_PB12_ PB12,GPIO_AF3
#define OCTOSPIM_P1_NCLK_PF11_ PF11,GPIO_AF9
#define _OCTOSPIM_P1_NCLK_PB12_ 1
#define _OCTOSPIM_P1_NCLK_PF11_ 1

#define OCTOSPIM_P1_NCS_PB10_ PB10,GPIO_AF9
#define OCTOSPIM_P1_NCS_PB6_ PB6,GPIO_AF10
#define OCTOSPIM_P1_NCS_PC11_ PC11,GPIO_AF9
#define OCTOSPIM_P1_NCS_PE11_ PE11,GPIO_AF11
#define OCTOSPIM_P1_NCS_PG6_ PG6,GPIO_AF10
#define _OCTOSPIM_P1_NCS_PB10_ 1
#define _OCTOSPIM_P1_NCS_PB6_ 1
#define _OCTOSPIM_P1_NCS_PC11_ 1
#define _OCTOSPIM_P1_NCS_PE11_ 1
#define _OCTOSPIM_P1_NCS_PG6_ 1

#define OCTOSPIM_P2_CLK_PF4_ PF4,GPIO_AF9
#define OCTOSPIM_P2_CLK_PI13_ PI13,GPIO_AF3
#define _OCTOSPIM_P2_CLK_PF4_ 1
#define _OCTOSPIM_P2_CLK_PI13_ 1

#define OCTOSPIM_P2_DQS_PF12_ PF12,GPIO_AF9
#define OCTOSPIM_P2_DQS_PG15_ PG15,GPIO_AF9
#define OCTOSPIM_P2_DQS_PG7_ PG7,GPIO_AF9
#define OCTOSPIM_P2_DQS_PK6_ PK6,GPIO_AF3
#define _OCTOSPIM_P2_DQS_PF12_ 1
#define _OCTOSPIM_P2_DQS_PG15_ 1
#define _OCTOSPIM_P2_DQS_PG7_ 1
#define _OCTOSPIM_P2_DQS_PK6_ 1

