susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H7A2.h
#define OCTOSPIM_P2_IO0_PF0_ PF0,GPIO_AF9
#define OCTOSPIM_P2_IO0_PI9_ PI9,GPIO_AF3
#define _OCTOSPIM_P2_IO0_PF0_ 1
#define _OCTOSPIM_P2_IO0_PI9_ 1

#define OCTOSPIM_P2_IO1_PF1_ PF1,GPIO_AF9
#define OCTOSPIM_P2_IO1_PI10_ PI10,GPIO_AF3
#define _OCTOSPIM_P2_IO1_PF1_ 1
#define _OCTOSPIM_P2_IO1_PI10_ 1

#define OCTOSPIM_P2_IO2_PF2_ PF2,GPIO_AF9
#define OCTOSPIM_P2_IO2_PI11_ PI11,GPIO_AF3
#define _OCTOSPIM_P2_IO2_PF2_ 1
#define _OCTOSPIM_P2_IO2_PI11_ 1

#define OCTOSPIM_P2_IO3_PF3_ PF3,GPIO_AF9
#define OCTOSPIM_P2_IO3_PI12_ PI12,GPIO_AF3
#define _OCTOSPIM_P2_IO3_PF3_ 1
#define _OCTOSPIM_P2_IO3_PI12_ 1

#define OCTOSPIM_P2_IO4_PG0_ PG0,GPIO_AF9
#define OCTOSPIM_P2_IO4_PJ1_ PJ1,GPIO_AF3
#define _OCTOSPIM_P2_IO4_PG0_ 1
#define _OCTOSPIM_P2_IO4_PJ1_ 1

#define OCTOSPIM_P2_IO5_PG1_ PG1,GPIO_AF9
#define OCTOSPIM_P2_IO5_PJ2_ PJ2,GPIO_AF3
#define _OCTOSPIM_P2_IO5_PG1_ 1
#define _OCTOSPIM_P2_IO5_PJ2_ 1

#define OCTOSPIM_P2_IO6_PG10_ PG10,GPIO_AF3
#define OCTOSPIM_P2_IO6_PK3_ PK3,GPIO_AF3
#define _OCTOSPIM_P2_IO6_PG10_ 1
#define _OCTOSPIM_P2_IO6_PK3_ 1

#define OCTOSPIM_P2_IO7_PG11_ PG11,GPIO_AF9
#define OCTOSPIM_P2_IO7_PK4_ PK4,GPIO_AF3
#define _OCTOSPIM_P2_IO7_PG11_ 1
#define _OCTOSPIM_P2_IO7_PK4_ 1

#define OCTOSPIM_P2_NCLK_PF5_ PF5,GPIO_AF9
#define OCTOSPIM_P2_NCLK_PI14_ PI14,GPIO_AF3
#define _OCTOSPIM_P2_NCLK_PF5_ 1
#define _OCTOSPIM_P2_NCLK_PI14_ 1

#define OCTOSPIM_P2_NCS_PG12_ PG12,GPIO_AF3
#define OCTOSPIM_P2_NCS_PK5_ PK5,GPIO_AF3
#define _OCTOSPIM_P2_NCS_PG12_ 1
#define _OCTOSPIM_P2_NCS_PK5_ 1

#define PSSI_D0_PA9_ PA9,GPIO_AF13
#define PSSI_D0_PC6_ PC6,GPIO_AF13
#define PSSI_D0_PH9_ PH9,GPIO_AF13
#define _PSSI_D0_PA9_ 1
#define _PSSI_D0_PC6_ 1
#define _PSSI_D0_PH9_ 1

#define PSSI_D1_PA10_ PA10,GPIO_AF13
#define PSSI_D1_PC7_ PC7,GPIO_AF13
#define PSSI_D1_PH10_ PH10,GPIO_AF13
#define _PSSI_D1_PA10_ 1
#define _PSSI_D1_PC7_ 1
#define _PSSI_D1_PH10_ 1

#define PSSI_D10_PB5_ PB5,GPIO_AF13
#define PSSI_D10_PD6_ PD6,GPIO_AF13
#define PSSI_D10_PI3_ PI3,GPIO_AF13
#define _PSSI_D10_PB5_ 1
#define _PSSI_D10_PD6_ 1
#define _PSSI_D10_PI3_ 1

#define PSSI_D11_PD2_ PD2,GPIO_AF13
#define PSSI_D11_PF10_ PF10,GPIO_AF13
#define PSSI_D11_PH15_ PH15,GPIO_AF13
#define _PSSI_D11_PD2_ 1
#define _PSSI_D11_PF10_ 1
#define _PSSI_D11_PH15_ 1

#define PSSI_D12_PD12_ PD12,GPIO_AF13
#define PSSI_D12_PF11_ PF11,GPIO_AF13
#define PSSI_D12_PG6_ PG6,GPIO_AF13
#define _PSSI_D12_PD12_ 1
#define _PSSI_D12_PF11_ 1
#define _PSSI_D12_PG6_ 1

#define PSSI_D13_PD13_ PD13,GPIO_AF13
#define PSSI_D13_PG15_ PG15,GPIO_AF13
#define PSSI_D13_PG7_ PG7,GPIO_AF13
#define PSSI_D13_PI0_ PI0,GPIO_AF13
#define _PSSI_D13_PD13_ 1
#define _PSSI_D13_PG15_ 1
#define _PSSI_D13_PG7_ 1
#define _PSSI_D13_PI0_ 1

#define PSSI_D14_PA5_ PA5,GPIO_AF13
#define PSSI_D14_PH4_ PH4,GPIO_AF13
#define PSSI_D14_PI10_ PI10,GPIO_AF13
#define _PSSI_D14_PA5_ 1
#define _PSSI_D14_PH4_ 1
#define _PSSI_D14_PI10_ 1

#define PSSI_D15_PC5_ PC5,GPIO_AF4
#define PSSI_D15_PF10_ PF10,GPIO_AF4
#define PSSI_D15_PI11_ PI11,GPIO_AF13
#define _PSSI_D15_PC5_ 1
#define _PSSI_D15_PF10_ 1
#define _PSSI_D15_PI11_ 1

#define PSSI_D2_PB13_ PB13,GPIO_AF13
#define PSSI_D2_PC8_ PC8,GPIO_AF13
#define PSSI_D2_PE0_ PE0,GPIO_AF13
#define PSSI_D2_PG10_ PG10,GPIO_AF13
#define PSSI_D2_PH11_ PH11,GPIO_AF13
#define _PSSI_D2_PB13_ 1
#define _PSSI_D2_PC8_ 1
#define _PSSI_D2_PE0_ 1
#define _PSSI_D2_PG10_ 1
#define _PSSI_D2_PH11_ 1

#define PSSI_D3_PC9_ PC9,GPIO_AF13
#define PSSI_D3_PE1_ PE1,GPIO_AF13
#define PSSI_D3_PG11_ PG11,GPIO_AF13
#define PSSI_D3_PH12_ PH12,GPIO_AF13
#define _PSSI_D3_PC9_ 1
#define _PSSI_D3_PE1_ 1
#define _PSSI_D3_PG11_ 1
#define _PSSI_D3_PH12_ 1

#define PSSI_D4_PC11_ PC11,GPIO_AF13
#define PSSI_D4_PE4_ PE4,GPIO_AF13
#define PSSI_D4_PH14_ PH14,GPIO_AF13
#define _PSSI_D4_PC11_ 1
#define _PSSI_D4_PE4_ 1
#define _PSSI_D4_PH14_ 1

#define PSSI_D5_PB6_ PB6,GPIO_AF13
#define PSSI_D5_PD3_ PD3,GPIO_AF13
#define PSSI_D5_PI4_ PI4,GPIO_AF13
#define _PSSI_D5_PB6_ 1
#define _PSSI_D5_PD3_ 1
#define _PSSI_D5_PI4_ 1

#define PSSI_D6_PB8_ PB8,GPIO_AF13
#define PSSI_D6_PE5_ PE5,GPIO_AF13
#define PSSI_D6_PI6_ PI6,GPIO_AF13
#define _PSSI_D6_PB8_ 1
#define _PSSI_D6_PE5_ 1
#define _PSSI_D6_PI6_ 1

#define PSSI_D7_PB9_ PB9,GPIO_AF13
#define PSSI_D7_PE6_ PE6,GPIO_AF13
#define PSSI_D7_PI7_ PI7,GPIO_AF13
#define _PSSI_D7_PB9_ 1
#define _PSSI_D7_PE6_ 1
#define _PSSI_D7_PI7_ 1

#define PSSI_D8_PC10_ PC10,GPIO_AF13
#define PSSI_D8_PH6_ PH6,GPIO_AF13
#define PSSI_D8_PI1_ PI1,GPIO_AF13
#define _PSSI_D8_PC10_ 1
#define _PSSI_D8_PH6_ 1
#define _PSSI_D8_PI1_ 1

#define PSSI_D9_PC12_ PC12,GPIO_AF13
#define PSSI_D9_PH7_ PH7,GPIO_AF13
#define PSSI_D9_PI2_ PI2,GPIO_AF13
#define _PSSI_D9_PC12_ 1
#define _PSSI_D9_PH7_ 1
#define _PSSI_D9_PI2_ 1

#define PSSI_DE_PA4_ PA4,GPIO_AF13
#define PSSI_DE_PH8_ PH8,GPIO_AF13
#define _PSSI_DE_PA4_ 1
#define _PSSI_DE_PH8_ 1

#define PSSI_PDCK_PA6_ PA6,GPIO_AF13
#define _PSSI_PDCK_PA6_ 1

#define PSSI_RDY_PB7_ PB7,GPIO_AF13
#define PSSI_RDY_PG9_ PG9,GPIO_AF13
#define PSSI_RDY_PI5_ PI5,GPIO_AF13
#define _PSSI_RDY_PB7_ 1
#define _PSSI_RDY_PG9_ 1
#define _PSSI_RDY_PI5_ 1

#define PWR_CSLEEP_PC3_ PC3,GPIO_AF0
#define PWR_CSLEEP_PC3_C_ PC3_C,GPIO_AF0
#define _PWR_CSLEEP_PC3_ 1
#define _PWR_CSLEEP_PC3_C_ 1

#define PWR_CSTOP_PC2_ PC2,GPIO_AF0
#define PWR_CSTOP_PC2_C_ PC2_C,GPIO_AF0
#define _PWR_CSTOP_PC2_ 1
#define _PWR_CSTOP_PC2_C_ 1

#define PWR_NDSTOP2_PA5_ PA5,GPIO_AF0
#define _PWR_NDSTOP2_PA5_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PE2_ PE2,GPIO_AF2
#define _SAI1_CK1_PE2_ 1

#define SAI1_CK2_PE5_ PE5,GPIO_AF2
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PB2_ PB2,GPIO_AF2
#define SAI1_D1_PC1_ PC1,GPIO_AF2
#define SAI1_D1_PD6_ PD6,GPIO_AF2
#define SAI1_D1_PE6_ PE6,GPIO_AF2
#define _SAI1_D1_PB2_ 1
#define _SAI1_D1_PC1_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PE4_ PE4,GPIO_AF2
#define _SAI1_D2_PE4_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF2
#define SAI1_D3_PF10_ PF10,GPIO_AF2
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_FS_A_PE4_ PE4,GPIO_AF6
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PF9_ PF9,GPIO_AF6
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF6
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF6
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

