susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32H7A2.h
#define UART5_CTS_PC9_ PC9,GPIO_AF8
#define _UART5_CTS_PC9_ 1

#define UART5_DE_PC8_ PC8,GPIO_AF8
#define _UART5_DE_PC8_ 1

#define UART5_RTS_PC8_ PC8,GPIO_AF8
#define _UART5_RTS_PC8_ 1

#define UART5_RX_PB12_ PB12,GPIO_AF14
#define UART5_RX_PB5_ PB5,GPIO_AF14
#define UART5_RX_PD2_ PD2,GPIO_AF8
#define _UART5_RX_PB12_ 1
#define _UART5_RX_PB5_ 1
#define _UART5_RX_PD2_ 1

#define UART5_TX_PB13_ PB13,GPIO_AF14
#define UART5_TX_PB6_ PB6,GPIO_AF14
#define UART5_TX_PC12_ PC12,GPIO_AF8
#define _UART5_TX_PB13_ 1
#define _UART5_TX_PB6_ 1
#define _UART5_TX_PC12_ 1

#define UART6_CK_PC8_ PC8,GPIO_AF7
#define UART6_CK_PG7_ PG7,GPIO_AF7
#define _UART6_CK_PC8_ 1
#define _UART6_CK_PG7_ 1

#define UART6_CTS_PG13_ PG13,GPIO_AF7
#define UART6_CTS_PG15_ PG15,GPIO_AF7
#define _UART6_CTS_PG13_ 1
#define _UART6_CTS_PG15_ 1

#define UART6_DE_PG12_ PG12,GPIO_AF7
#define UART6_DE_PG8_ PG8,GPIO_AF7
#define _UART6_DE_PG12_ 1
#define _UART6_DE_PG8_ 1

#define UART6_NSS_PG13_ PG13,GPIO_AF7
#define UART6_NSS_PG15_ PG15,GPIO_AF7
#define _UART6_NSS_PG13_ 1
#define _UART6_NSS_PG15_ 1

#define UART6_RTS_PG12_ PG12,GPIO_AF7
#define UART6_RTS_PG8_ PG8,GPIO_AF7
#define _UART6_RTS_PG12_ 1
#define _UART6_RTS_PG8_ 1

#define UART6_RX_PC7_ PC7,GPIO_AF7
#define UART6_RX_PG9_ PG9,GPIO_AF7
#define _UART6_RX_PC7_ 1
#define _UART6_RX_PG9_ 1

#define UART6_TX_PC6_ PC6,GPIO_AF7
#define UART6_TX_PG14_ PG14,GPIO_AF7
#define _UART6_TX_PC6_ 1
#define _UART6_TX_PG14_ 1

#define UART7_CTS_PE10_ PE10,GPIO_AF7
#define UART7_CTS_PF9_ PF9,GPIO_AF7
#define _UART7_CTS_PE10_ 1
#define _UART7_CTS_PF9_ 1

#define UART7_DE_PE9_ PE9,GPIO_AF7
#define UART7_DE_PF8_ PF8,GPIO_AF7
#define _UART7_DE_PE9_ 1
#define _UART7_DE_PF8_ 1

#define UART7_RTS_PE9_ PE9,GPIO_AF7
#define UART7_RTS_PF8_ PF8,GPIO_AF7
#define _UART7_RTS_PE9_ 1
#define _UART7_RTS_PF8_ 1

#define UART7_RX_PA8_ PA8,GPIO_AF11
#define UART7_RX_PB3_ PB3,GPIO_AF11
#define UART7_RX_PE7_ PE7,GPIO_AF7
#define UART7_RX_PF6_ PF6,GPIO_AF7
#define _UART7_RX_PA8_ 1
#define _UART7_RX_PB3_ 1
#define _UART7_RX_PE7_ 1
#define _UART7_RX_PF6_ 1

#define UART7_TX_PA15_ PA15,GPIO_AF11
#define UART7_TX_PB4_ PB4,GPIO_AF11
#define UART7_TX_PE8_ PE8,GPIO_AF7
#define UART7_TX_PF7_ PF7,GPIO_AF7
#define _UART7_TX_PA15_ 1
#define _UART7_TX_PB4_ 1
#define _UART7_TX_PE8_ 1
#define _UART7_TX_PF7_ 1

#define UART8_CTS_PD14_ PD14,GPIO_AF8
#define _UART8_CTS_PD14_ 1

#define UART8_DE_PD15_ PD15,GPIO_AF8
#define _UART8_DE_PD15_ 1

#define UART8_RTS_PD15_ PD15,GPIO_AF8
#define _UART8_RTS_PD15_ 1

#define UART8_RX_PE0_ PE0,GPIO_AF8
#define UART8_RX_PJ9_ PJ9,GPIO_AF8
#define _UART8_RX_PE0_ 1
#define _UART8_RX_PJ9_ 1

#define UART8_TX_PE1_ PE1,GPIO_AF8
#define UART8_TX_PJ8_ PJ8,GPIO_AF8
#define _UART8_TX_PE1_ 1
#define _UART8_TX_PJ8_ 1

#define UART9_CTS_PD0_ PD0,GPIO_AF11
#define UART9_CTS_PJ4_ PJ4,GPIO_AF11
#define _UART9_CTS_PD0_ 1
#define _UART9_CTS_PJ4_ 1

#define UART9_DE_PD13_ PD13,GPIO_AF11
#define UART9_DE_PJ3_ PJ3,GPIO_AF11
#define _UART9_DE_PD13_ 1
#define _UART9_DE_PJ3_ 1

#define UART9_RTS_PD13_ PD13,GPIO_AF11
#define UART9_RTS_PJ3_ PJ3,GPIO_AF11
#define _UART9_RTS_PD13_ 1
#define _UART9_RTS_PJ3_ 1

#define UART9_RX_PD14_ PD14,GPIO_AF11
#define UART9_RX_PG0_ PG0,GPIO_AF11
#define _UART9_RX_PD14_ 1
#define _UART9_RX_PG0_ 1

#define UART9_TX_PD15_ PD15,GPIO_AF11
#define UART9_TX_PG1_ PG1,GPIO_AF11
#define _UART9_TX_PD15_ 1
#define _UART9_TX_PG1_ 1

#define USART10_CK_PE15_ PE15,GPIO_AF11
#define USART10_CK_PG15_ PG15,GPIO_AF11
#define _USART10_CK_PE15_ 1
#define _USART10_CK_PG15_ 1

#define USART10_CTS_PG13_ PG13,GPIO_AF11
#define _USART10_CTS_PG13_ 1

#define USART10_DE_PG14_ PG14,GPIO_AF11
#define _USART10_DE_PG14_ 1

#define USART10_NSS_PG13_ PG13,GPIO_AF11
#define _USART10_NSS_PG13_ 1

#define USART10_RTS_PG14_ PG14,GPIO_AF11
#define _USART10_RTS_PG14_ 1

#define USART10_RX_PE2_ PE2,GPIO_AF11
#define USART10_RX_PG11_ PG11,GPIO_AF11
#define _USART10_RX_PE2_ 1
#define _USART10_RX_PG11_ 1

#define USART10_TX_PE3_ PE3,GPIO_AF11
#define USART10_TX_PG12_ PG12,GPIO_AF11
#define _USART10_TX_PE3_ 1
#define _USART10_TX_PG12_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define _USART1_DE_PA12_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define _USART1_NSS_PA11_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB15_ PB15,GPIO_AF4
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB15_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB14_ PB14,GPIO_AF4
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB14_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PD7_ PD7,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PA0_C_ PA0_C,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PA0_C_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define USART2_DE_PA1_C_ PA1_C,GPIO_AF7
#define USART2_DE_PD4_ PD4,GPIO_AF7
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PA1_C_ 1
#define _USART2_DE_PD4_ 1

#define USART2_NSS_PA0_ PA0,GPIO_AF7
#define USART2_NSS_PA0_C_ PA0_C,GPIO_AF7
#define USART2_NSS_PD3_ PD3,GPIO_AF7
#define _USART2_NSS_PA0_ 1
#define _USART2_NSS_PA0_C_ 1
#define _USART2_NSS_PD3_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PA1_C_ PA1_C,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF7
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PA1_C_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD6_ PD6,GPIO_AF7
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD5_ PD5,GPIO_AF7
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

